import pandas as pd
df = [{'price': ['1608'], 'position': ['萧山区', '城厢', '绿都四季华庭']},
    {'price': ['1021'], 'position': ['萧山区', '城厢', '绿都四季华庭']},
    {'price': ['997'], 'position': ['余杭区', '临平', '新城山语院']},
    {'price': ['787'], 'position': ['余杭区', '临平', '新城山语院']},
    {'price': ['662'], 'position': ['萧山区', '义蓬', '盛都苑']},
    {'price': ['810'], 'position': ['余杭区', '南苑', '红联九漾华庭东区']},
    {'price': ['907'], 'position': ['江干区', '九堡', '三卫家园南苑']},
    {'price': ['945'], 'position': ['萧山区', '义蓬', '宋都丽郡国际']},
    {'price': ['945'], 'position': ['萧山区', '义蓬', '宋都丽郡园']},
    {'price': ['1313'], 'position': ['萧山区', '钱江世纪城', '顺丰家园']},
    {'price': ['945'], 'position': ['萧山区', '义蓬', '宋都丽郡园']},
    {'price': ['975'], 'position': ['西湖区', '转塘', '定北家园二区']},
    {'price': ['919'], 'position': ['萧山区', '义蓬', '宋都丽郡园']},
    {'price': ['831'], 'position': ['余杭区', '南苑', '红联九漾华庭东区']},
    {'price': ['752'], 'position': ['萧山区', '义蓬', '宋都丽郡国际']},
    {'price': ['919'], 'position': ['萧山区', '义蓬', '宋都丽郡国际']},
    {'price': ['770'], 'position': ['萧山区', '义蓬', '义蓬名苑']},
    {'price': ['1004'], 'position': ['西湖区', '转塘', '定北家园二区']},
    {'price': ['945'], 'position': ['萧山区', '义蓬', '宋都丽郡园']},
    {'price': ['2325'], 'position': ['滨江区', '西兴', '迎春南苑']},
    {'price': ['1748'], 'position': ['萧山区', '宁围街道', '盈一佳苑']}]
df1 = pd.DataFrame(df)
print(df1)
df1.to_csv('ab.csv')